#+OPTIONS: toc:nil num:1

*** Plotly init

*Init for plotly*

Import plotly and associated modules. Sets some themes and creates some backend depend export functions.

#+NAME: pab/plotly-init-block
#+BEGIN_src python :exports results :results raw :noweb yes :session
import plotly.express as px

import plotly.io as pio
pio.templates.default  = "plotly_dark"
pio.kaleido.scope.plotlyjs = "/usr/share/python3-plotly/plotly.js"

import imageio

def plotly_save_html(fig, filename, **kwargs):
    yaml_frontmatter = "---\nlayout: plotly\n---\n\n"
    fig_html = fig.to_html(include_plotlyjs = "cdn", include_mathjax = "cdn", full_html = False, **kwargs)

    with open(filename, "w", encoding="utf-8") as f:
        f.write(yaml_frontmatter + fig_html)

def plotly_export_html(fig, filename, width, height):
    html_template="""
    ,#+BEGIN_export html
    <iframe allowfullscreen="" frameborder="0" width="{width}" height="{height}" scrolling="no" src="{filename}"></iframe>
    ,#+END_export
    """

    return(html_template.format(filename=filename, height=height, width="100%"))

def plotly_save_png(fig, filename, **kwargs):
    fig.write_image(filename)

    fig_png = imageio.v3.imread(filename)
    return ([(fig_png.shape)[1], (fig_png.shape)[0]])

def plotly_export_latex(fig, filename):

    return(f"[[file:{filename}]]")

def plotly_export_static(fig, filename):

    return(f"[[file:{filename}]]")

def plotly_export(fig, plotname, backend, **kwargs):
    htmldir = f"/home/paul/teaching/export/html/"
    pngdir = f"/home/paul/teaching/export/tex/"
    filename = f"figs/{plotname}"
    png_filename = f"{filename}.png"
    html_filename = f"/{filename}.html"

    width, height = plotly_save_png(fig, f"{pngdir}/{png_filename}", **kwargs)
    plotly_save_html(fig, f"{htmldir}/{filename}.html", **kwargs)

    if backend == "html":
        ret = plotly_export_html(fig, f"/{filename}", width, height)
    elif backend == "latex":
        ret = plotly_export_latex(fig, png_filename)
    else:
        ret = plotly_export_static(fig, f"{pngdir}/{png_filename}")

    return(ret)
#+END_src

#+RESULTS: pab/plotly-init-block
None

